app/controllers/items_controller.rb

	def expensive
		@items = Item.where("price > 1000")
---
SELECT "items".* FROM "items"  WHERE (price > 1000)

	def create
		#item_params = params.require(:item).permit(:name, :description, :weight, :price, :real, :item_id, :cart_id, :quantity, :comentable_id, :body, :user_id)
@item = Item.create(item_params)
---
INSERT INTO "items" ("created_at", "description", "name", "price", "real", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-12-26 14:58:11.756282"], ["description", "good car"], ["name", "car1"], ["price", 500000.0], ["real", "t"], ["updated_at", "2014-12-26 14:58:11.756282"], ["weight", 0.0]]

	def update

		#item_params = params.require(:item).permit(:name, :description, :weight, :price, :real, :item_id, :cart_id, :quantity, :comentable_id, :body, :user_id)

		@item.update_attributes(item_params)
---
UPDATE "items" SET "name" = ?, "description" = ?, "weight" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Телефон HONOR 1"], ["description", "Отличный телефон с 8MP камерой"], ["weight", 0.2], ["updated_at", "2015-01-13 18:20:08.181735"], ["id", 2]]

	def upvote
		@item.increment!(:votes_count)
---
UPDATE "items" SET "votes_count" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["votes_count", 7], ["updated_at", "2015-01-09 11:35:31.967804"], ["id", 9]]

	def find_item
	@item = Item.where(id:params[:id]).first
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ?  ORDER BY "items"."id" ASC LIMIT 1  [["id", 9]]